package ru.rgs.APITests;

import com.google.gson.Gson;
import com.google.gson.GsonBuilder;
import org.apache.commons.io.IOUtils;
import ru.rgs.APITests.model.SearchInsurer.InsurerFull.FullInsurerResponse;
import ru.rgs.APITests.model.SearchVehicle.full.VehicleFound;
import ru.rgs.APITests.model.contracts.osago.create.OsagoCreate;
import ru.rgs.APITests.model.contracts.osago.submit.Insurer;
import ru.rgs.APITests.model.contracts.osago.submit.OsagoSubmit;

import java.io.BufferedInputStream;
import java.io.FileInputStream;
import java.io.IOException;

import static java.nio.charset.StandardCharsets.UTF_8;

/**
 * Created by Алексей on 09.11.2017.
 */
public class SubmitOsagoTest {

    public static void main(String[] args) throws IOException {
        String json = "{\n" +
                "   \"dataList\":[\n" +
                "      {\n" +
                "         \"id\":\"72018f80c1c90c45f11e790bc\",\n" +
                "         \"entityChangeId\":\"720187b11d440c46011e790bc\",\n" +
                "         \"bid\":\"72018\",\n" +
                "         \"isNotResident\":\"false\",\n" +
                "         \"isIpension\":\"false\",\n" +
                "         \"isOverload\":\"false\",\n" +
                "         \"displayName\":\"Автотестер Автотестер\",\n" +
                "         \"documentList\":[\n" +
                "            {\n" +
                "               \"lastModified\":\"2017-11-08T11:40:31.0\",\n" +
                "               \"sysUser\":\"tim440\",\n" +
                "               \"sysSource\":\"1\",\n" +
                "               \"sysCreator\":\"1\",\n" +
                "               \"sysEditor\":\"1\",\n" +
                "               \"isIdPregenerated\":\"false\",\n" +
                "               \"versionStartDate\":\"2017-11-08T11:40:31.0\",\n" +
                "               \"versionEndDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"entityChangeId\":\"720187b11d440c46011e790bc\",\n" +
                "               \"id\":\"72018fd972dd0c45f11e790bc\",\n" +
                "               \"personId\":\"72018f80c1c90c45f11e790bc\",\n" +
                "               \"bid\":\"72018\",\n" +
                "               \"documentType\":{\n" +
                "                  \"id\":\"017\",\n" +
                "                  \"name\":\"Водительское удостоверение РФ\",\n" +
                "                  \"sortOrder\":\"170\",\n" +
                "                  \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "                  \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                  \"code\":\"017\",\n" +
                "                  \"codeAndName\":\"017 - Водительское удостоверение РФ\"\n" +
                "               },\n" +
                "               \"documentGroup\":{\n" +
                "                  \"id\":\"1\",\n" +
                "                  \"name\":\"Основной документ\",\n" +
                "                  \"sortOrder\":\"10\",\n" +
                "                  \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "                  \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                  \"code\":\"1\",\n" +
                "                  \"codeAndName\":\"1 - Основной документ\"\n" +
                "               },\n" +
                "               \"series\":\"4561\",\n" +
                "               \"number\":\"123456\",\n" +
                "               \"issueDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"vehicleTypeExperienceList\":[\n" +
                "                  {\n" +
                "                     \"lastModified\":\"2017-11-08T11:40:31.0\",\n" +
                "                     \"sysUser\":\"tim440\",\n" +
                "                     \"sysCreateDate\":\"2017-11-08T11:36:51.0\",\n" +
                "                     \"sysCreateUser\":\"tim440\",\n" +
                "                     \"sysSource\":\"1\",\n" +
                "                     \"sysCreator\":\"1\",\n" +
                "                     \"sysEditor\":\"1\",\n" +
                "                     \"isIdPregenerated\":\"false\",\n" +
                "                     \"id\":\"72018ff88c4a0c45f11e790bc\",\n" +
                "                     \"bid\":\"72018\",\n" +
                "                     \"documentId\":\"72018fd972dd0c45f11e790bc\",\n" +
                "                     \"vehicleType\":{\n" +
                "                        \"id\":\"2\",\n" +
                "                        \"name\":\"Легковые автомобили (ТС категории В)\",\n" +
                "                        \"sortOrder\":\"20\",\n" +
                "                        \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "                        \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                        \"code\":\"2\",\n" +
                "                        \"codeAndName\":\"2 - Легковые автомобили (ТС категории В)\"\n" +
                "                     },\n" +
                "                     \"drivingStartDate\":\"1999-01-01T00:00:00.0\"\n" +
                "                  }\n" +
                "               ]\n" +
                "            }\n" +
                "         ],\n" +
                "         \"primaryAddress\":{\n" +
                "            \"id\":\"72018ff993f60c45f11e790bc\",\n" +
                "            \"addressType\":{\n" +
                "               \"code\":\"1\",\n" +
                "               \"name\":\"Адрес регистрации\",\n" +
                "               \"sortOrder\":\"10\"\n" +
                "            },\n" +
                "            \"country\":{\n" +
                "               \"id\":\"643\",\n" +
                "               \"name\":\"Российская Федерация\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"643\",\n" +
                "               \"codeAndName\":\"643 - Российская Федерация\",\n" +
                "               \"shortName\":\"РОССИЯ\",\n" +
                "               \"literalIsoId\":\"RUS\",\n" +
                "               \"literalDnsId\":\"RU\"\n" +
                "            },\n" +
                "            \"territory\":{\n" +
                "               \"id\":\"162094\",\n" +
                "               \"parentId\":\"29269\",\n" +
                "               \"territoryType\":{\n" +
                "                  \"id\":\"3\",\n" +
                "                  \"code\":\"3\",\n" +
                "                  \"name\":\"город\",\n" +
                "                  \"shortName\":\"г.\",\n" +
                "                  \"objectLevel\":\"3\"\n" +
                "               },\n" +
                "               \"kladrTerritoryCode\":\"2800000300000\",\n" +
                "               \"name\":\"Белогорск\",\n" +
                "               \"isLeaf\":\"false\",\n" +
                "               \"selectable\":\"true\",\n" +
                "               \"path\":\"Амурская обл.\",\n" +
                "               \"fullPath\":\"Амурская обл., г. Белогорск\"\n" +
                "            },\n" +
                "            \"exactAddress\":\"ул 1-я Вокзальная, д. 5, корпус 5, строение 5, № квартиры/№ офиса 5\",\n" +
                "            \"kladrStreet\":{\n" +
                "               \"id\":\"28000003000002400\",\n" +
                "               \"type\":\"ул\",\n" +
                "               \"name\":\"1-я Вокзальная\",\n" +
                "               \"zip\":\"676850\"\n" +
                "            },\n" +
                "            \"zip\":\"676850\",\n" +
                "            \"houseNumber\":\"5\",\n" +
                "            \"buildingNumber\":\"5\",\n" +
                "            \"structureNumber\":\"5\",\n" +
                "            \"flatNumber\":\"5\",\n" +
                "            \"isNotStreet\":\"false\"\n" +
                "         },\n" +
                "         \"additionalAddress\":{\n" +
                "            \"id\":\"72018ff993f61c45f11e790bc\",\n" +
                "            \"addressType\":{\n" +
                "               \"code\":\"2\",\n" +
                "               \"name\":\"Почтовый адрес\",\n" +
                "               \"sortOrder\":\"20\"\n" +
                "            },\n" +
                "            \"country\":{\n" +
                "               \"id\":\"643\",\n" +
                "               \"name\":\"Российская Федерация\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"643\",\n" +
                "               \"codeAndName\":\"643 - Российская Федерация\",\n" +
                "               \"shortName\":\"РОССИЯ\",\n" +
                "               \"literalIsoId\":\"RUS\",\n" +
                "               \"literalDnsId\":\"RU\"\n" +
                "            },\n" +
                "            \"territory\":{\n" +
                "               \"id\":\"162094\",\n" +
                "               \"parentId\":\"29269\",\n" +
                "               \"territoryType\":{\n" +
                "                  \"id\":\"3\",\n" +
                "                  \"code\":\"3\",\n" +
                "                  \"name\":\"город\",\n" +
                "                  \"shortName\":\"г.\",\n" +
                "                  \"objectLevel\":\"3\"\n" +
                "               },\n" +
                "               \"kladrTerritoryCode\":\"2800000300000\",\n" +
                "               \"name\":\"Белогорск\",\n" +
                "               \"isLeaf\":\"false\",\n" +
                "               \"selectable\":\"true\",\n" +
                "               \"path\":\"Амурская обл.\",\n" +
                "               \"fullPath\":\"Амурская обл., г. Белогорск\"\n" +
                "            },\n" +
                "            \"exactAddress\":\"ул 1-я Вокзальная, д. 5, корпус 5, строение 5, № квартиры/№ офиса 5\",\n" +
                "            \"kladrStreet\":{\n" +
                "               \"id\":\"28000003000002400\",\n" +
                "               \"type\":\"ул\",\n" +
                "               \"name\":\"1-я Вокзальная\",\n" +
                "               \"zip\":\"676850\"\n" +
                "            },\n" +
                "            \"zip\":\"676850\",\n" +
                "            \"houseNumber\":\"5\",\n" +
                "            \"buildingNumber\":\"5\",\n" +
                "            \"structureNumber\":\"5\",\n" +
                "            \"flatNumber\":\"5\",\n" +
                "            \"isNotStreet\":\"false\"\n" +
                "         },\n" +
                "         \"personType\":{\n" +
                "            \"code\":\"1\",\n" +
                "            \"name\":\"Физическое лицо\",\n" +
                "            \"sortOrder\":\"10\"\n" +
                "         },\n" +
                "         \"lastName\":\"Автотестер\",\n" +
                "         \"firstName\":\"Автотестер\",\n" +
                "         \"birthDate\":\"1970-01-01T00:00:00.0\",\n" +
                "         \"sex\":\"1\",\n" +
                "         \"nationality\":{\n" +
                "            \"id\":\"643\",\n" +
                "            \"name\":\"Российская Федерация\",\n" +
                "            \"sortOrder\":\"10\",\n" +
                "            \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "            \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "            \"code\":\"643\",\n" +
                "            \"codeAndName\":\"643 - Российская Федерация\",\n" +
                "            \"shortName\":\"РОССИЯ\",\n" +
                "            \"literalIsoId\":\"RUS\",\n" +
                "            \"literalDnsId\":\"RU\"\n" +
                "         },\n" +
                "         \"isForeignPublic\":\"false\",\n" +
                "         \"isNotOkved\":\"false\",\n" +
                "         \"isInboul\":\"false\",\n" +
                "         \"lastModified\":\"2017-11-08T11:40:31.0\",\n" +
                "         \"sysEditor\":\"21\",\n" +
                "         \"primaryDocumentTypeList\":[\n" +
                "            {\n" +
                "               \"id\":\"023\",\n" +
                "               \"name\":\"Другой документ\",\n" +
                "               \"sortOrder\":\"230\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"023\",\n" +
                "               \"codeAndName\":\"023 - Другой документ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"030\",\n" +
                "               \"name\":\"Свидетельство о предоставлении временного убежища на территории Российской Федерации\",\n" +
                "               \"sortOrder\":\"300\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"030\",\n" +
                "               \"codeAndName\":\"030 - Свидетельство о предоставлении временного убежища на территории Российской Федерации\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"031\",\n" +
                "               \"name\":\"Удостоверение личности военнослужащего Российской Федерации\",\n" +
                "               \"sortOrder\":\"310\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"031\",\n" +
                "               \"codeAndName\":\"031 - Удостоверение личности военнослужащего Российской Федерации\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"032\",\n" +
                "               \"name\":\"Паспорт гражданина Украины\",\n" +
                "               \"sortOrder\":\"320\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"032\",\n" +
                "               \"codeAndName\":\"032 - Паспорт гражданина Украины\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"033\",\n" +
                "               \"name\":\"Разрешение на временное проживание в Российской Федерации\",\n" +
                "               \"sortOrder\":\"330\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"033\",\n" +
                "               \"codeAndName\":\"033 - Разрешение на временное проживание в Российской Федерации\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"034\",\n" +
                "               \"name\":\"Временное удостоверение, выданное взамен военного билета\",\n" +
                "               \"sortOrder\":\"340\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"034\",\n" +
                "               \"codeAndName\":\"034 - Временное удостоверение, выданное взамен военного билета\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"039\",\n" +
                "               \"name\":\"Удостоверение тракториста-машиниста\",\n" +
                "               \"sortOrder\":\"390\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"039\",\n" +
                "               \"codeAndName\":\"039 - Удостоверение тракториста-машиниста\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"040\",\n" +
                "               \"name\":\"Удостоверение тракториста-машиниста старого образца\",\n" +
                "               \"sortOrder\":\"400\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"040\",\n" +
                "               \"codeAndName\":\"040 - Удостоверение тракториста-машиниста старого образца\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"001\",\n" +
                "               \"name\":\"Свидетельство о рождении РФ\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"001\",\n" +
                "               \"codeAndName\":\"001 - Свидетельство о рождении РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"002\",\n" +
                "               \"name\":\"Удостоверение личности офицера РФ\",\n" +
                "               \"sortOrder\":\"20\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"002\",\n" +
                "               \"codeAndName\":\"002 - Удостоверение личности офицера РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"003\",\n" +
                "               \"name\":\"Справка об освобождении из места лишения свободы РФ\",\n" +
                "               \"sortOrder\":\"30\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"003\",\n" +
                "               \"codeAndName\":\"003 - Справка об освобождении из места лишения свободы РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"004\",\n" +
                "               \"name\":\"Паспорт Минморфлота\",\n" +
                "               \"sortOrder\":\"40\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"004\",\n" +
                "               \"codeAndName\":\"004 - Паспорт Минморфлота\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"005\",\n" +
                "               \"name\":\"Военный билет солдата (матроса, сержанта, старшины) РФ\",\n" +
                "               \"sortOrder\":\"50\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"005\",\n" +
                "               \"codeAndName\":\"005 - Военный билет солдата (матроса, сержанта, старшины) РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"006\",\n" +
                "               \"name\":\"Дипломатический паспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"60\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"006\",\n" +
                "               \"codeAndName\":\"006 - Дипломатический паспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"007\",\n" +
                "               \"name\":\"Иностранный паспорт\",\n" +
                "               \"sortOrder\":\"70\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"007\",\n" +
                "               \"codeAndName\":\"007 - Иностранный паспорт\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"008\",\n" +
                "               \"name\":\"Свидетельство о регистрации ходатайства иммигранта о признании его беженцем\",\n" +
                "               \"sortOrder\":\"80\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"008\",\n" +
                "               \"codeAndName\":\"008 - Свидетельство о регистрации ходатайства иммигранта о признании его беженцем\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"009\",\n" +
                "               \"name\":\"Вид на жительство\",\n" +
                "               \"sortOrder\":\"90\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"009\",\n" +
                "               \"codeAndName\":\"009 - Вид на жительство\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"010\",\n" +
                "               \"name\":\"Удостоверение беженца в РФ\",\n" +
                "               \"sortOrder\":\"100\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"010\",\n" +
                "               \"codeAndName\":\"010 - Удостоверение беженца в РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"011\",\n" +
                "               \"name\":\"Временное удостоверение личности гражданина РФ\",\n" +
                "               \"sortOrder\":\"110\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"011\",\n" +
                "               \"codeAndName\":\"011 - Временное удостоверение личности гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"012\",\n" +
                "               \"name\":\"Паспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"120\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"012\",\n" +
                "               \"codeAndName\":\"012 - Паспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"013\",\n" +
                "               \"name\":\"Загранпаспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"130\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"013\",\n" +
                "               \"codeAndName\":\"013 - Загранпаспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"014\",\n" +
                "               \"name\":\"Свидетельство о рождении, выданное уполномоченным органом иностранного государства\",\n" +
                "               \"sortOrder\":\"140\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"014\",\n" +
                "               \"codeAndName\":\"014 - Свидетельство о рождении, выданное уполномоченным органом иностранного государства\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"015\",\n" +
                "               \"name\":\"Паспорт моряка\",\n" +
                "               \"sortOrder\":\"150\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"015\",\n" +
                "               \"codeAndName\":\"015 - Паспорт моряка\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"016\",\n" +
                "               \"name\":\"Военный билет офицера запаса РФ\",\n" +
                "               \"sortOrder\":\"160\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"016\",\n" +
                "               \"codeAndName\":\"016 - Военный билет офицера запаса РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"018\",\n" +
                "               \"name\":\"Иные документы, выдаваемые органами МВД России\",\n" +
                "               \"sortOrder\":\"180\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"018\",\n" +
                "               \"codeAndName\":\"018 - Иные документы, выдаваемые органами МВД России\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"019\",\n" +
                "               \"name\":\"Паспорт гражданина СССР\",\n" +
                "               \"sortOrder\":\"190\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"019\",\n" +
                "               \"codeAndName\":\"019 - Паспорт гражданина СССР\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"020\",\n" +
                "               \"name\":\"Загранпаспорт гражданина СССР\",\n" +
                "               \"sortOrder\":\"200\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"020\",\n" +
                "               \"codeAndName\":\"020 - Загранпаспорт гражданина СССР\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"017\",\n" +
                "               \"name\":\"Водительское удостоверение РФ\",\n" +
                "               \"sortOrder\":\"170\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"017\",\n" +
                "               \"codeAndName\":\"017 - Водительское удостоверение РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"024\",\n" +
                "               \"name\":\"Водительское удостоверение иностранного государства\",\n" +
                "               \"sortOrder\":\"240\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"024\",\n" +
                "               \"codeAndName\":\"024 - Водительское удостоверение иностранного государства\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"022\",\n" +
                "               \"name\":\"Свидетельство о смерти\",\n" +
                "               \"sortOrder\":\"220\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"022\",\n" +
                "               \"codeAndName\":\"022 - Свидетельство о смерти\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"additionalDocumentTypeList\":[\n" +
                "            {\n" +
                "               \"id\":\"039\",\n" +
                "               \"name\":\"Удостоверение тракториста-машиниста\",\n" +
                "               \"sortOrder\":\"390\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"039\",\n" +
                "               \"codeAndName\":\"039 - Удостоверение тракториста-машиниста\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"040\",\n" +
                "               \"name\":\"Удостоверение тракториста-машиниста старого образца\",\n" +
                "               \"sortOrder\":\"400\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"040\",\n" +
                "               \"codeAndName\":\"040 - Удостоверение тракториста-машиниста старого образца\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"001\",\n" +
                "               \"name\":\"Свидетельство о рождении РФ\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"001\",\n" +
                "               \"codeAndName\":\"001 - Свидетельство о рождении РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"002\",\n" +
                "               \"name\":\"Удостоверение личности офицера РФ\",\n" +
                "               \"sortOrder\":\"20\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"002\",\n" +
                "               \"codeAndName\":\"002 - Удостоверение личности офицера РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"003\",\n" +
                "               \"name\":\"Справка об освобождении из места лишения свободы РФ\",\n" +
                "               \"sortOrder\":\"30\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"003\",\n" +
                "               \"codeAndName\":\"003 - Справка об освобождении из места лишения свободы РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"004\",\n" +
                "               \"name\":\"Паспорт Минморфлота\",\n" +
                "               \"sortOrder\":\"40\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"004\",\n" +
                "               \"codeAndName\":\"004 - Паспорт Минморфлота\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"005\",\n" +
                "               \"name\":\"Военный билет солдата (матроса, сержанта, старшины) РФ\",\n" +
                "               \"sortOrder\":\"50\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"005\",\n" +
                "               \"codeAndName\":\"005 - Военный билет солдата (матроса, сержанта, старшины) РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"006\",\n" +
                "               \"name\":\"Дипломатический паспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"60\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"006\",\n" +
                "               \"codeAndName\":\"006 - Дипломатический паспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"007\",\n" +
                "               \"name\":\"Иностранный паспорт\",\n" +
                "               \"sortOrder\":\"70\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"007\",\n" +
                "               \"codeAndName\":\"007 - Иностранный паспорт\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"008\",\n" +
                "               \"name\":\"Свидетельство о регистрации ходатайства иммигранта о признании его беженцем\",\n" +
                "               \"sortOrder\":\"80\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"008\",\n" +
                "               \"codeAndName\":\"008 - Свидетельство о регистрации ходатайства иммигранта о признании его беженцем\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"009\",\n" +
                "               \"name\":\"Вид на жительство\",\n" +
                "               \"sortOrder\":\"90\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"009\",\n" +
                "               \"codeAndName\":\"009 - Вид на жительство\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"010\",\n" +
                "               \"name\":\"Удостоверение беженца в РФ\",\n" +
                "               \"sortOrder\":\"100\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"010\",\n" +
                "               \"codeAndName\":\"010 - Удостоверение беженца в РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"011\",\n" +
                "               \"name\":\"Временное удостоверение личности гражданина РФ\",\n" +
                "               \"sortOrder\":\"110\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"011\",\n" +
                "               \"codeAndName\":\"011 - Временное удостоверение личности гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"012\",\n" +
                "               \"name\":\"Паспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"120\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"012\",\n" +
                "               \"codeAndName\":\"012 - Паспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"013\",\n" +
                "               \"name\":\"Загранпаспорт гражданина РФ\",\n" +
                "               \"sortOrder\":\"130\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"013\",\n" +
                "               \"codeAndName\":\"013 - Загранпаспорт гражданина РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"014\",\n" +
                "               \"name\":\"Свидетельство о рождении, выданное уполномоченным органом иностранного государства\",\n" +
                "               \"sortOrder\":\"140\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"014\",\n" +
                "               \"codeAndName\":\"014 - Свидетельство о рождении, выданное уполномоченным органом иностранного государства\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"015\",\n" +
                "               \"name\":\"Паспорт моряка\",\n" +
                "               \"sortOrder\":\"150\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"015\",\n" +
                "               \"codeAndName\":\"015 - Паспорт моряка\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"016\",\n" +
                "               \"name\":\"Военный билет офицера запаса РФ\",\n" +
                "               \"sortOrder\":\"160\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"016\",\n" +
                "               \"codeAndName\":\"016 - Военный билет офицера запаса РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"017\",\n" +
                "               \"name\":\"Водительское удостоверение РФ\",\n" +
                "               \"sortOrder\":\"170\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"017\",\n" +
                "               \"codeAndName\":\"017 - Водительское удостоверение РФ\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"018\",\n" +
                "               \"name\":\"Иные документы, выдаваемые органами МВД России\",\n" +
                "               \"sortOrder\":\"180\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"018\",\n" +
                "               \"codeAndName\":\"018 - Иные документы, выдаваемые органами МВД России\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"019\",\n" +
                "               \"name\":\"Паспорт гражданина СССР\",\n" +
                "               \"sortOrder\":\"190\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"019\",\n" +
                "               \"codeAndName\":\"019 - Паспорт гражданина СССР\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"020\",\n" +
                "               \"name\":\"Загранпаспорт гражданина СССР\",\n" +
                "               \"sortOrder\":\"200\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"020\",\n" +
                "               \"codeAndName\":\"020 - Загранпаспорт гражданина СССР\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"022\",\n" +
                "               \"name\":\"Свидетельство о смерти\",\n" +
                "               \"sortOrder\":\"220\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"022\",\n" +
                "               \"codeAndName\":\"022 - Свидетельство о смерти\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"024\",\n" +
                "               \"name\":\"Водительское удостоверение иностранного государства\",\n" +
                "               \"sortOrder\":\"240\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"024\",\n" +
                "               \"codeAndName\":\"024 - Водительское удостоверение иностранного государства\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"bonusMalusList\":[\n" +
                "            {\n" +
                "               \"id\":\"M\",\n" +
                "               \"name\":\"M\",\n" +
                "               \"sortOrder\":\"-1\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"M\",\n" +
                "               \"codeAndName\":\"M - M\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"0\",\n" +
                "               \"name\":\"0\",\n" +
                "               \"sortOrder\":\"0\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"0\",\n" +
                "               \"codeAndName\":\"0 - 0\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"1\",\n" +
                "               \"name\":\"1\",\n" +
                "               \"sortOrder\":\"1\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"1\",\n" +
                "               \"codeAndName\":\"1 - 1\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"2\",\n" +
                "               \"name\":\"2\",\n" +
                "               \"sortOrder\":\"2\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"2\",\n" +
                "               \"codeAndName\":\"2 - 2\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"3\",\n" +
                "               \"name\":\"3\",\n" +
                "               \"sortOrder\":\"3\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"3\",\n" +
                "               \"codeAndName\":\"3 - 3\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"4\",\n" +
                "               \"name\":\"4\",\n" +
                "               \"sortOrder\":\"4\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"4\",\n" +
                "               \"codeAndName\":\"4 - 4\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"5\",\n" +
                "               \"name\":\"5\",\n" +
                "               \"sortOrder\":\"5\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"5\",\n" +
                "               \"codeAndName\":\"5 - 5\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"6\",\n" +
                "               \"name\":\"6\",\n" +
                "               \"sortOrder\":\"6\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"6\",\n" +
                "               \"codeAndName\":\"6 - 6\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"7\",\n" +
                "               \"name\":\"7\",\n" +
                "               \"sortOrder\":\"7\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"7\",\n" +
                "               \"codeAndName\":\"7 - 7\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"8\",\n" +
                "               \"name\":\"8\",\n" +
                "               \"sortOrder\":\"8\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"8\",\n" +
                "               \"codeAndName\":\"8 - 8\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"9\",\n" +
                "               \"name\":\"9\",\n" +
                "               \"sortOrder\":\"9\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"9\",\n" +
                "               \"codeAndName\":\"9 - 9\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"10\",\n" +
                "               \"name\":\"10\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"10\",\n" +
                "               \"codeAndName\":\"10 - 10\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"11\",\n" +
                "               \"name\":\"11\",\n" +
                "               \"sortOrder\":\"11\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"11\",\n" +
                "               \"codeAndName\":\"11 - 11\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"12\",\n" +
                "               \"name\":\"12\",\n" +
                "               \"sortOrder\":\"12\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"12\",\n" +
                "               \"codeAndName\":\"12 - 12\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"13\",\n" +
                "               \"name\":\"13\",\n" +
                "               \"sortOrder\":\"13\",\n" +
                "               \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"13\",\n" +
                "               \"codeAndName\":\"13 - 13\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"possessionGroundList\":[\n" +
                "            {\n" +
                "               \"id\":\"1\",\n" +
                "               \"name\":\"Собственник\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"1\",\n" +
                "               \"codeAndName\":\"1 - Собственник\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"2\",\n" +
                "               \"name\":\"Доверенность\",\n" +
                "               \"sortOrder\":\"20\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"2014-07-20T00:00:00.0\",\n" +
                "               \"code\":\"2\",\n" +
                "               \"codeAndName\":\"2 - Доверенность\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"3\",\n" +
                "               \"name\":\"Аренда\",\n" +
                "               \"sortOrder\":\"30\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"3\",\n" +
                "               \"codeAndName\":\"3 - Аренда\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"4\",\n" +
                "               \"name\":\"Лизинг\",\n" +
                "               \"sortOrder\":\"40\",\n" +
                "               \"startDate\":\"2014-05-01T00:00:00.0\",\n" +
                "               \"endDate\":\"2014-05-04T00:00:00.0\",\n" +
                "               \"code\":\"4\",\n" +
                "               \"codeAndName\":\"4 - Лизинг\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"5\",\n" +
                "               \"name\":\"Прокат\",\n" +
                "               \"sortOrder\":\"50\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"5\",\n" +
                "               \"codeAndName\":\"5 - Прокат\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"6\",\n" +
                "               \"name\":\"Иное\",\n" +
                "               \"sortOrder\":\"60\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"6\",\n" +
                "               \"codeAndName\":\"6 - Иное\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"vehicleTypeList\":[\n" +
                "            {\n" +
                "               \"id\":\"1\",\n" +
                "               \"name\":\"Мотоциклы и мотороллеры (ТС категории А)\",\n" +
                "               \"sortOrder\":\"10\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"1\",\n" +
                "               \"codeAndName\":\"1 - Мотоциклы и мотороллеры (ТС категории А)\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"2\",\n" +
                "               \"name\":\"Легковые автомобили (ТС категории В)\",\n" +
                "               \"sortOrder\":\"20\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"2\",\n" +
                "               \"codeAndName\":\"2 - Легковые автомобили (ТС категории В)\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"3\",\n" +
                "               \"name\":\"Грузовые автомобили (ТС категории С)\",\n" +
                "               \"sortOrder\":\"30\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"3\",\n" +
                "               \"codeAndName\":\"3 - Грузовые автомобили (ТС категории С)\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"4\",\n" +
                "               \"name\":\"Автобусы (ТС категории Д)\",\n" +
                "               \"sortOrder\":\"40\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"4\",\n" +
                "               \"codeAndName\":\"4 - Автобусы (ТС категории Д)\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"5\",\n" +
                "               \"name\":\"Троллейбусы\",\n" +
                "               \"sortOrder\":\"50\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"5\",\n" +
                "               \"codeAndName\":\"5 - Троллейбусы\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"6\",\n" +
                "               \"name\":\"Трамваи\",\n" +
                "               \"sortOrder\":\"60\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"6\",\n" +
                "               \"codeAndName\":\"6 - Трамваи\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"7\",\n" +
                "               \"name\":\"Тракторы, самоходные дорожно-строительные и иные машины\",\n" +
                "               \"sortOrder\":\"70\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"7\",\n" +
                "               \"codeAndName\":\"7 - Тракторы, самоходные дорожно-строительные и иные машины\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"8\",\n" +
                "               \"name\":\"Прицепы к легковым автомобилям, мотоциклам, мотороллерам\",\n" +
                "               \"sortOrder\":\"80\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"8\",\n" +
                "               \"codeAndName\":\"8 - Прицепы к легковым автомобилям, мотоциклам, мотороллерам\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"9\",\n" +
                "               \"name\":\"Прицепы к грузовым автомобилям, полуприцепы, прицепы-роспуски\",\n" +
                "               \"sortOrder\":\"90\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"9\",\n" +
                "               \"codeAndName\":\"9 - Прицепы к грузовым автомобилям, полуприцепы, прицепы-роспуски\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"10\",\n" +
                "               \"name\":\"Прицепы к тракторам, самоходным дорожно-строительным и иным машинам\",\n" +
                "               \"sortOrder\":\"100\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"10\",\n" +
                "               \"codeAndName\":\"10 - Прицепы к тракторам, самоходным дорожно-строительным и иным машинам\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"businessmanRgsAgent\":\"false\",\n" +
                "         \"addressShortInfo\":\"676850, РОССИЯ, Амурская обл., г. Белогорск, ул 1-я Вокзальная, д. 5, корпус 5, строение 5, № квартиры/№ офиса 5\",\n" +
                "         \"personChangeList\":[\n" +
                "            {\n" +
                "               \"id\":\"720187b11d440c46011e790bc\",\n" +
                "               \"bid\":\"72018\",\n" +
                "               \"sysUser\":\"tim440\",\n" +
                "               \"subjectId\":\"72018f80c1c90c45f11e790bc\",\n" +
                "               \"startDate\":\"2017-11-08T11:40:31.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"versionNumber\":\"2\",\n" +
                "               \"isCanceled\":\"false\",\n" +
                "               \"displayName\":\"Автотестер Автотестер\",\n" +
                "               \"isNewHistory\":\"false\"\n" +
                "            },\n" +
                "            {\n" +
                "               \"id\":\"72018fd51c060c45f11e790bc\",\n" +
                "               \"bid\":\"72018\",\n" +
                "               \"sysUser\":\"tim440\",\n" +
                "               \"subjectId\":\"72018f80c1c90c45f11e790bc\",\n" +
                "               \"startDate\":\"2017-11-08T11:36:51.0\",\n" +
                "               \"endDate\":\"2017-11-08T11:40:30.0\",\n" +
                "               \"versionNumber\":\"1\",\n" +
                "               \"isCanceled\":\"false\",\n" +
                "               \"displayName\":\"Автотестер Автотестер\",\n" +
                "               \"isNewHistory\":\"false\"\n" +
                "            }\n" +
                "         ]\n" +
                "      }\n" +
                "   ],\n" +
                "   \"totalLength\":1,\n" +
                "   \"success\":true\n" +
                "}";

        String vehicle = "{\n" +
                "   \"dataList\":[\n" +
                "      {\n" +
                "         \"id\":\"720183f491c70c46011e7ab51\",\n" +
                "         \"displayName\":\"Acura CL\",\n" +
                "         \"lastModified\":\"2017-11-08T12:35:23.0\",\n" +
                "         \"bid\":\"72018\",\n" +
                "         \"subjectType\":{\n" +
                "            \"code\":\"4\",\n" +
                "            \"name\":\"Автомобиль\",\n" +
                "            \"sortOrder\":\"40\"\n" +
                "         },\n" +
                "         \"vehicleType\":{\n" +
                "            \"id\":\"2\",\n" +
                "            \"name\":\"Легковые автомобили (ТС категории В)\",\n" +
                "            \"sortOrder\":\"20\",\n" +
                "            \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "            \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "            \"code\":\"2\",\n" +
                "            \"codeAndName\":\"2 - Легковые автомобили (ТС категории В)\"\n" +
                "         },\n" +
                "         \"brand\":{\n" +
                "            \"id\":\"002\",\n" +
                "            \"name\":\"Acura\",\n" +
                "            \"sortOrder\":\"2\",\n" +
                "            \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "            \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "            \"code\":\"002\",\n" +
                "            \"codeAndName\":\"002 - Acura\",\n" +
                "            \"isForeign\":\"true\"\n" +
                "         },\n" +
                "         \"model\":{\n" +
                "            \"id\":\"20\",\n" +
                "            \"name\":\"CL\",\n" +
                "            \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "            \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "            \"code\":\"20\",\n" +
                "            \"codeAndName\":\"20 - CL\",\n" +
                "            \"brand\":{\n" +
                "               \"id\":\"002\",\n" +
                "               \"name\":\"Acura\",\n" +
                "               \"sortOrder\":\"2\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"002\",\n" +
                "               \"codeAndName\":\"002 - Acura\",\n" +
                "               \"isForeign\":\"true\"\n" +
                "            },\n" +
                "            \"vehicleType\":{\n" +
                "               \"id\":\"2\",\n" +
                "               \"name\":\"Легковые автомобили (ТС категории В)\",\n" +
                "               \"sortOrder\":\"20\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"2\",\n" +
                "               \"codeAndName\":\"2 - Легковые автомобили (ТС категории В)\"\n" +
                "            },\n" +
                "            \"vehicleGroup\":{\n" +
                "               \"id\":\"3\",\n" +
                "               \"name\":\"Группа ИГ3\",\n" +
                "               \"sortOrder\":\"30\",\n" +
                "               \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "               \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "               \"code\":\"3\",\n" +
                "               \"codeAndName\":\"3 - Группа ИГ3\"\n" +
                "            }\n" +
                "         },\n" +
                "         \"vin\":\"123456789123456\",\n" +
                "         \"isNotVinSpecified\":\"false\",\n" +
                "         \"enginePowerHp\":\"100\",\n" +
                "         \"enginePowerKw\":\"73.5499\",\n" +
                "         \"constructionDate\":\"2000-01-01T00:00:00.0\",\n" +
                "         \"contractList\":[\n" +
                "            {\n" +
                "               \"id\":\"7201836783560c46811e783de\",\n" +
                "               \"bid\":\"72018\",\n" +
                "               \"entityPurpose\":\"1\",\n" +
                "               \"series\":\"ССС\",\n" +
                "               \"number\":\"8889971164\",\n" +
                "               \"contractDate\":\"2017-11-08T00:00:00.0\",\n" +
                "               \"useNewCascoDate\":\"2016-12-01T00:00:00.0\",\n" +
                "               \"isSimplifiedForm\":\"false\",\n" +
                "               \"mainClientReference\":{\n" +
                "                  \"id\":\"72018f80c1c90c45f11e790bc\",\n" +
                "                  \"displayName\":\"Автотестер Автотестер\",\n" +
                "                  \"subjectType\":{\n" +
                "                     \"code\":\"1\",\n" +
                "                     \"name\":\"Физическое лицо\",\n" +
                "                     \"sortOrder\":\"10\"\n" +
                "                  }\n" +
                "               },\n" +
                "               \"contractStatus\":{\n" +
                "                  \"code\":\"20\",\n" +
                "                  \"name\":\"Действующий, не оплачен\",\n" +
                "                  \"sortOrder\":\"20\",\n" +
                "                  \"isActive\":\"1\"\n" +
                "               },\n" +
                "               \"lastModified\":\"2017-11-08T12:35:48.0\",\n" +
                "               \"contractStartDate\":\"2017-11-08T00:00:00.0\",\n" +
                "               \"contractEndDate\":\"2018-11-07T23:59:59.0\",\n" +
                "               \"contractType\":{\n" +
                "                  \"id\":\"2\",\n" +
                "                  \"name\":\"ОСАГО\",\n" +
                "                  \"sortOrder\":\"20\",\n" +
                "                  \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "                  \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                  \"code\":\"2\",\n" +
                "                  \"codeAndName\":\"2 - ОСАГО\"\n" +
                "               },\n" +
                "               \"product\":{\n" +
                "                  \"id\":\"02001\",\n" +
                "                  \"name\":\"ОСАГО\",\n" +
                "                  \"sortOrder\":\"20\",\n" +
                "                  \"startDate\":\"2000-01-01T00:00:00.0\",\n" +
                "                  \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                  \"code\":\"02001\",\n" +
                "                  \"codeAndName\":\"02001 - ОСАГО\",\n" +
                "                  \"productNumber\":\"3\",\n" +
                "                  \"contractType\":{\n" +
                "                     \"id\":\"2\",\n" +
                "                     \"name\":\"ОСАГО\",\n" +
                "                     \"sortOrder\":\"20\",\n" +
                "                     \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "                     \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                     \"code\":\"2\",\n" +
                "                     \"codeAndName\":\"2 - ОСАГО\"\n" +
                "                  },\n" +
                "                  \"productType\":{\n" +
                "                     \"id\":\"2\",\n" +
                "                     \"name\":\"Авто\",\n" +
                "                     \"sortOrder\":\"20\",\n" +
                "                     \"startDate\":\"1900-01-01T00:00:00.0\",\n" +
                "                     \"endDate\":\"3000-01-01T00:00:00.0\",\n" +
                "                     \"code\":\"2\",\n" +
                "                     \"codeAndName\":\"2 - Авто\"\n" +
                "                  },\n" +
                "                  \"personRole\":{\n" +
                "\n" +
                "                  }\n" +
                "               },\n" +
                "               \"productVariant\":{\n" +
                "                  \"id\":\"2\",\n" +
                "                  \"name\":\"ОСАГО физических лиц\",\n" +
                "                  \"code\":\"2\",\n" +
                "                  \"codeAndName\":\"2 - ОСАГО физических лиц\"\n" +
                "               },\n" +
                "               \"isTIConcluded\":\"false\",\n" +
                "               \"isTIPlusConcluded\":\"false\"\n" +
                "            }\n" +
                "         ],\n" +
                "         \"sysEditor\":\"21\"\n" +
                "      }\n" +
                "   ],\n" +
                "   \"totalLength\":1,\n" +
                "   \"success\":true\n" +
                "}";
        String osago = IOUtils.toString(new BufferedInputStream(new FileInputStream("osago")), UTF_8);
        Gson gson = new GsonBuilder().serializeNulls().create();
        FullInsurerResponse fullInsurerResponse = gson.fromJson(json, FullInsurerResponse.class);
        Insurer insurer = new Insurer(fullInsurerResponse.getFullInsurers().get(0));
        System.out.println(insurer);
        VehicleFound vehicleFound = gson.fromJson(vehicle, VehicleFound.class);
        OsagoCreate osagoCreate = gson.fromJson(osago, OsagoCreate.class);
        OsagoSubmit osagoSubmit = new OsagoSubmit(osagoCreate, fullInsurerResponse.getFullInsurers().get(0), vehicleFound.getVehicles().get(0));
        System.out.println(gson.toJson(osagoSubmit));
    }
}
